app/controllers/videos_controller.rb

SELECT * FROM `videos` ORDER BY id desc LIMIT 10
---
  def index
    @videos = Video.all :limit=>10, :order=>'id desc'

SELECT * FROM `videos` WHERE (`videos`.`id` = 1)
---
  def show
    @video = Video.find(params[:id])